{

"0" : {
		"exp" : 25,

		"startMsg" : "
			#Stranger# Oh, hello there...=>
			#Stranger# Uhm... I haven't seen you here before, who are you?=>
			#Stranger# Well, to be honest, it doesn't matter. Not in this place.=>
			#Richard# My name is... uhm... Dick, but I don't really like it. Call me Richard.=>
			#Richard# You seem lost... You know what? If you can prove you can be of any use, then we'll talk.=>
			#Richard# Can you please bring me some wood for the campfire? Here's an axe, it'll help you.=>
			#Richard# Return to me when you get 15 wood pieces.=>
			* You can gather wood by taking axe in your hands (open inventory with E key and left click the axe), approaching a tree and hitting enter or clicking it a few times.=>
			* You can also interact with trees with your bare hands, then you'll get another kind of resource.
		",

	"endMsg" : "
		#Richard# Thanks a lot, stranger.=>
		#Richard# I'd like to know your name now...=>
		#Richard# Nice to meet you, {PLAYER}!=>
		#Richard# Here, take these berries. You earned them. =>
		#Richard# Hm... well, you can also take my axe as a reward. I didn't use it anyway. If you want some job or a good story, just ask!
	",

	"reqMsg" : "#Richard# Please, give me 15 wood pieces.",

	"reqItems" : "1/15",
	"giveItems" : "3/1",
	"rewardItems" : "7/12",
	"removeOnCompletion" : "n",
	"repeatable" : false
},

"1" : {
	"exp" : 35,

	"startMsg" : "
		#Richard# So, {PLAYER}, you liked using that axe, huh? [Uhh...]=>
		#Richard# Guess what, I can show you how to make one yourself. You can even make other great tools that'll help you in this cruel world. [I'm interested]=>
		#Richard# Well, let me remember... Ah! Bring me some small rocks. 10 of them, to be more specific. You can find them near boulders. It won't be easy to gather them with your bare hands, but it's worth it, trust me!=>
		* To gather small rocks, approach a boulder and interact with it.
	",

	"endMsg" : "
		#Richard# That's what I'm talking about!=>
		#Richard# So, to make a tool or really anything you can imagine you need to gather ingredients for it first.=>
		#Richard# Or you can just buy a recipe from crafts master, but it's more fullfilling to figure out the recipe yourself, isn't it?=>
		#Richard# Well, I did my part, you did yours. If you need something - just ask! Bye!=>
		* To figure out a recipe, you need to gather some resources and open \"craft\" menu from inventory. If you find new resources that can be used in some recipe, a new entry will appear on the craft screen as well as the notification in the game log.=>
		* For example, if you gather some sticks and small rocks, you'll unlock a couple of new recipes. Go try it out.=>
		#Richard# Oh... I didn't give you any reward? You can have my leftover birthday cake, it even still has candles in it! [Ugh... Cool... Thanks?]
	",

	"reqMsg" : "#Richard# Have you gathered those 10 small rocks I asked you for yet?",

	"reqItems" : "2/10",
	"giveItems" : "n",
	"rewardItems" : "4/4:2/10",
	"removeOnCompletion" : "n",
	"repeatable" : false
},

"2" : {
	"exp" : 40,
	"startMsg" : "
		#Richard# Oi, {PLAYER}! I need your help again. [What do you need this time?]=>
		#Richard# I need some clay to make myself new tableware because I broke every single dish when I was drunk yesterday... [I'm sorry for your... Uhm... Loss.]=>
		#Richard# Yeah, that sucks. You know how to dig things up don't you? [Of course! (I actually don't)]=>
		* To dig something up from the ground you need a tool. To be more specific - a shovel.=>
		* You can make one from sticks and small rocks. Just gather them, open your inventory, then craft menu and craft a stone shovel.=>
		* Then you need to find Flint and Clay somewhere.
		When you find a thing to dig up, just take your shovel to your hand, stand on the tile that contains the item you want to dig up
		and press the button that appears on the screen. Alternatively, you can use \"U\" button on the keyboard.=>
		#Richard# Hmmm... I believe you. Okay, dig up 5 flint and 5 clay pieces and bring them to me.
	",

	"endMsg" : "
		#Richard# Thanks, brother! I'm beginning to think that I might even invite you to our faction... [Your faction?]=>
		#Richard# Yeah, I'm a member of \"The Partisans of The Dead Lands\" faction. What a pretentious name, don't you think? [Meh]=>
		#Richard# So... Let's talk about this later. I need to contact our leader about you.
	",

	"reqMsg" : "#Richard# Bring me 5 flint and 5 clay pieces.",

	"reqItems" : "5/5:9/5",
	"giveItems" : "n",
	"rewardItems" : "n",
	"removeOnCompletion" : "n",
	"repeatable" : false
},

"3" : {
	"exp" : 80,
	"startMsg" : "
		#Richard# Hello, {PLAYER}!=>
		#Richard# I think it's time for you to go to the dungeon.=>
		#Richard# We have a pretty bad rodent infestation problem there, so why don't you kill 10 rats and bring me leather pieces you get from them?.[Hmm... Sure, why not?]=>
		#Richard# But first, you must find an entrance to the dungeon.[Whoa, that sounds dangerous]=>
		#Richard# To do this, take a walk around and see if you spot any holes in the ground... [And?]=>
		#Richard# Once you've spotted a hole, you can carefully climb down to the dungeon. [Understood]=>
		#Richard# It's not an easy task, so here - take these vegetables, you can use them to regain some of your strength between the battles =>
		* To go underground, you have to stand on a \"hole in the ground\" tile and press \"use\" button or the on-screen pop-up button.
	",

	"endMsg" : "#Richard# Thank you, {PLAYER}! Take your reward and return to me when you are ready for the next task.",

	"reqMsg" : "#Richard# Kill 10 rats and give me 10 leather pieces you get from them.",

	"reqItems" : "22/10",
	"giveItems" : "47/5:49/5",
	"rewardItems" : "n",
	"removeOnCompletion" : "-1",
	"repeatable" : false
},

"4" : {
	"exp" : 50,
	"startMsg" : "
		#Richard# Hello, {PLAYER}!=>
		#Richard# You know, our camp gets raided by Marauders pretty frequently. But now that you appeared out of nowhere, I've got a strange feeling that we have a chance against them!=>
		#Richard# Go kill 10 rookie marauders to scare them off. Then we'll begin to plan something bigger.
	",

	"endMsg" : "#Richard# Thank you, hero! Take your reward and return to me when you are ready for the next task.",

	"reqMsg" : "#Richard# Kill 10 marauders and give me 10 leather pieces you get from them.",

	"reqItems" : "22/10",
	"giveItems" : "2/5",
	"rewardItems" : "n",
	"removeOnCompletion" : "-1",
	"repeatable" : false
}

}