{
	"strings" : {
		"GameStart" : "
			/DefaultTitle(Welcome)
			{FASTER}
			Welcome to MadSand, {PLAYER}!
			{p}This game *someday will be* an open-world survival sandbox RPG.
			{p}It's in the early stage of development, so feel free to explore and provide feedback and suggestions about what you see in the game or what you want to see in the future.
			{p}If I were you, I'd start by exploring and interacting with things.
			{p}To interact with an object or NPC, approach it and click on it with LMB or click on it with RMB and choose the \"interact\" option, or, for keyboard lovers - turn your character to it using arrow keys and press enter.
			{p}Via interaction with objects you can gather resources that can be crafted into something or sold to a trader. You'll have to gather all the needed components for a certain item to unlock a craft recipe for it.
			{p}And if you decide to interact with an NPC, you can talk to them by left clicking. Some NPCs can give you various tasks and some can trade with you. /Button(I didn't ask, but thanks!) =>

			/Title(Controls)
			{FASTER}
			And almost forgot, here are the controls:
			{p}
			* WASD or LMB click - walk around{br}
			* Middle mouse button or Arrow keys - turn around without moving{br}
			* LMB click or Enter - interact with an object/NPC{br}
			* LMB click - attack a hostile creature{br}
			* Arrows or \"Attack\" option in RMB menu - attack a neutral creature (be careful, they'll become hostile and will fight back){br}
			* LMB click on yourself or Space - rest for a turn{br}
			* U or LMB click on the \"Hand\" equip slot - use currently held placeable block or placeable tile (or a special tool, for example, hoe){br}
			* G or \"Save game\" button in ESC menu  - save current world{br}
			/Button(Woah, thanks!)
		",
		
		"LowStamina" : "
			/DefaultTitle(Low Stamina)
			Easy there, {PLAYER}! You are about to deplete your stamina! /Button(Oops. What's dat?) =>
			Stamina is used to gather resources, or use items. It regenerates once per time tick when your satiation level (food) is above certain percent. =>
			/Title(Resting) You can replenish your stamina by resting. To rest for 1 tick, press space or click on yourself with LMB. To rest until the stamina is fully restored, click on your character with RMB and choose the \"Rest fully\" option.=>
			If you deplete your stamina, you won't be able to do any stamina-dependent activities until your stamina is at least partially replenished. /Button(Oh. I see.) =>
			You'll also start losing 1 hp per time tick while your stamina is 0.
		",
		
		"Travel" : "
			/DefaultTitle(Travelling Kits)
			Travelling kits are used to travel to a previously unexplored area.{br}
			You can buy one from a trader or craft it from leather. /Button(Nice)
		",
		
		"DungeonKey" : "
			/DefaultTitle(Dungeon Keys)
			You've just found your first dungeon key!{br}
			They're used to unlock entrances to challenge dungeons. =>
			You can find dungeon keys laying on altar pedestals in Dead Lands biome.{br}
			To take the key, you'll have to break the pedestal with a hammer or a pickaxe.
		"
	}
}